Тест1/src/DataProcessors/ВоронкаПродажПоКаналам/ВоронкаПродажПоКаналам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВоронкаПродажПоКаналам</name>
</mdclass:DataProcessor>

Тест1/src/InformationRegisters/МаршрутЗвонков/МаршрутЗвонков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МаршрутЗвонков</name>
  <resources>
    <name>Входящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВнутреннийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длительность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛинияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Успешность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>SIPНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </resources>
  <dimensions>
    <name>IDЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест1/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.Roistat_Сделки</registerRecords>
  <attributes>
    <name>КлиентНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.дт_СостоянияЗаказовКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСвязи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВнешний</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контролёр</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКонтроля</name>
    <type>
      <types>EnumRef.СтатусыКонтроляЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОписания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Канал</name>
    <type>
      <types>CatalogRef.ИсточникиОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаявки</name>
    <type>
      <types>EnumRef.ТипЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокументаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПредлагаемойЦены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоВзаимодействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Прослушано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АтоматическоеСоздание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПродажи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Целевая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодстатусОбработки</name>
    <type>
      <types>EnumRef.ПодстатусыОбработкиЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбработку</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>WTPanel</name>
    <type>
      <types>CatalogRef.СтатусыWT</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланРеагированияНаЗаявку</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаОригинала</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредлагаемаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.дт_РолиВПродаже</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/DataProcessors/ВоронкаПродажПоКаналам/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатыПоУмолчанию();
	ПолучитьСписокЛиний();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДиаграмму();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьОтменитьПриИзменении(Элемент)
	СброситьЗаполнитьСписокЛиний();	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокЛиний()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|ВЫБОР
		//|	КОГДА ЛинияНомер = """"
		//|   	ТОГДА ""<Пустое значение>""
		//|	ИНАЧЕ ЛинияНомер
		//|КОНЕЦ КАК ЛинияНомер
		| ЛинияНомер
		|	
		|ИЗ
		|  РегистрСведений.МаршрутЗвонков
		|
		|ГДЕ
		|	ЛинияНомер <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛинияНомер
		|";
		
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ВыборЛиний = Новый СписокЗначений;
	ВыборЛиний.ЗагрузитьЗначения(ТЗ.ВыгрузитьКолонку("ЛинияНомер"));
	
КонецПроцедуры

&НаСервере
Процедура СброситьЗаполнитьСписокЛиний()
	
	Для Каждого эл ИЗ ВыборЛиний Цикл
		эл.Пометка = ОтметитьОтменить;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыбранныйСписокЛиний()
	
	СписокВозврата = Новый СписокЗначений();
	Для Каждого эл ИЗ ВыборЛиний Цикл
		Если эл.Пометка Тогда
			СписокВозврата.Добавить(эл.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокВозврата;
	
КонецФункции

&НаСервере
Процедура ДатыПоУмолчанию()	
	НачальнаяДата 	= НачалоМесяца(ТекущаяДата());
	КонечнаяДата 	= КонецДня(ТекущаяДата());
КонецПроцедуры

&НаСервере
Функция ПолучитьВоронку()
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачальнаяДата", НачалоДня(НачальнаяДата));
	Запрос.УстановитьПараметр("КонечнаяДата", КонецДня(КонечнаяДата));
	Запрос.УстановитьПараметр("ВыбранныеЛинии", ВыбранныйСписокЛиний());
	Запрос.Текст = "ВЫБРАТЬ
		|///////////// Звонки
		|	МаршрутЗвонков.ЛинияНомер КАК ЛинияНомер,
		|	КОЛИЧЕСТВО(МаршрутЗвонков.ЛинияНомер) КАК Количество
		|	ПОМЕСТИТЬ табКоличествоЗвонков
		|
		|ИЗ
		|  РегистрСведений.МаршрутЗвонков КАК МаршрутЗвонков
		|
		|ГДЕ
		|	МаршрутЗвонков.Дата МЕЖДУ &НачальнаяДата И &КонечнаяДата	
		|	И МаршрутЗвонков.ЛинияНомер В (&ВыбранныеЛинии) 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛинияНомер
		|;
		|////// Список линий
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокЛиний.ЛинияНомер 
		|	ПОМЕСТИТЬ табСписокЛиний
		|
		|ИЗ
		|  РегистрСведений.МаршрутЗвонков КАК СписокЛиний
		|;
		|/////// Заявки
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Заявка.Ссылка) КАК Количество,
		|   МаршрутЗвонков.ЛинияНомер КАК ЛинияНомер
		|	ПОМЕСТИТЬ табКоличествоЗаявок
		|
		|ИЗ
		|	Документ.ЗаказКлиента КАК Заявка	
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.МаршрутЗвонков КАК МаршрутЗвонков	
		|ПО
		|	Заявка.Ссылка = МаршрутЗвонков.ЗаявкаКлиента
		|
		|ГДЕ
		|	Заявка.Дата МЕЖДУ &НачальнаяДата И &КонечнаяДата
		|	И МаршрутЗвонков.ЛинияНомер В (&ВыбранныеЛинии) 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛинияНомер
		|;
		|//////////// Продажи
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Продажа.Ссылка) КАК Количество,
		|   МаршрутЗвонков.ЛинияНомер КАК ЛинияНомер
		|	ПОМЕСТИТЬ табКоличествоПродаж
		|
		|ИЗ
		|	Документ.ПродажаЗапчастей КАК Продажа
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.МаршрутЗвонков КАК МаршрутЗвонков	
		|ПО
		|	Продажа.Ссылка.ЗаказКлиента = МаршрутЗвонков.ЗаявкаКлиента
		|
		|ГДЕ
		|	Продажа.Дата МЕЖДУ &НачальнаяДата И &КонечнаяДата
		|	И МаршрутЗвонков.ЛинияНомер В (&ВыбранныеЛинии) 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛинияНомер
		|;
		|/////////// Итоговая таблица
		|ВЫБРАТЬ
		//|	Итог.ЛинияНомер КАК ЛинияНомер,
		|	ИтогКоличествоЗвонков.Количество КАК КоличествоЗвонков,
		|   ИтогКоличествоЗаявок.Количество КАК КоличествоЗаявок,
		|	ИтогКоличествоПродаж.Количество КАК КоличествоПродаж
		|
		|ИЗ
		|	табСписокЛиний КАК Итог
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	табКоличествоЗвонков КАК ИтогКоличествоЗвонков
		|ПО
		|	Итог.ЛинияНомер = ИтогКоличествоЗвонков.ЛинияНомер
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	табКоличествоЗаявок КАК ИтогКоличествоЗаявок	
		|ПО
		|   Итог.ЛинияНомер = ИтогКоличествоЗаявок.ЛинияНомер
		|
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	табКоличествоПродаж КАК ИтогКоличествоПродаж
		|ПО
		|	Итог.ЛинияНомер = ИтогКоличествоПродаж.ЛинияНомер
		|
		|ГДЕ
		|	Итог.ЛинияНомер В (&ВыбранныеЛинии)	
		|
		|ИТОГИ
		|	СУММА(ИтогКоличествоЗвонков.Количество),
		|	СУММА(ИтогКоличествоЗаявок.Количество),
		|	СУММА(ИтогКоличествоПродаж.Количество)
		|ПО
		|	ОБЩИЕ 
		|
		|";
		
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если ТЗ.Количество() = 0 Тогда
		Возврат null;
	Иначе
		Возврат ТЗ[0];
	КонецЕсли;
		
КонецФункции

&НаСервере
Процедура ОбновитьДиаграмму()
	
	Диаграмма = ЭтотОбъект.ВыводДиаграмма;
	Диаграмма.Очистить();
	
	ДанныеДляДиаграммы = ПолучитьВоронку();
	
	Если ДанныеДляДиаграммы = null Тогда
		Возврат;	
	КонецЕсли;
	
	КолЗвонков 	= ?(ДанныеДляДиаграммы.КоличествоЗвонков = null, 0, ДанныеДляДиаграммы.КоличествоЗвонков);
	КолЗаявок	= ?(ДанныеДляДиаграммы.КоличествоЗаявок = null, 0, ДанныеДляДиаграммы.КоличествоЗаявок);
	КолПродаж	= ?(ДанныеДляДиаграммы.КоличествоПродаж = null, 0, ДанныеДляДиаграммы.КоличествоПродаж);
	
	ПроцентЗаявок = ?(КолЗвонков = 0, 0, Окр(КолЗаявок / КолЗвонков * 100, 0));
	ПроцентПродаж = ?(КолЗвонков = 0, 0, Окр(КолПродаж / КолЗвонков * 100, 0));
	
	Диаграмма.АвтоТранспонирование 	= Истина;
	Диаграмма.Обновление 			= Ложь;
	
	ТекстЗвонки = "ЗВОНКИ" + Символы.ПС +
					Символы.ПС +
					"Количество: " + КолЗвонков + Символы.ПС + 
					"Процент: 100 %";
	
	ТекстЗаявки = "ЗАЯВКИ" + Символы.ПС + 
					Символы.ПС +
					"Количество: " + КолЗаявок + Символы.ПС +
					"Процент: " + ПроцентЗаявок + " %";
	
	ТекстПродажи = "ПРОДАЖИ
					|
					|Количество: " + КолПродаж + "
					|Процент: " + ПроцентПродаж + " %";
		
	Диаграмма.Серии.Добавить(ТекстЗвонки);
	Диаграмма.Серии[0].Цвет = WebЦвета.Голубой;
	Диаграмма.Серии.Добавить(ТекстЗаявки);
	Диаграмма.Серии[1].Цвет = WebЦвета.Желтый;
	Диаграмма.Серии.Добавить(ТекстПродажи);
	Диаграмма.Серии[2].Цвет = WebЦвета.СветлоЗеленый;
	
	Точка = Диаграмма.УстановитьТочку("Воронка");
		
	Диаграмма.УстановитьЗначение(Точка
			, Диаграмма.Серии[0]
			, КолЗвонков
			, Неопределено
			, "Звонки");				
	Диаграмма.УстановитьЗначение(Точка
			, Диаграмма.Серии[1]
			, КолЗаявок
			, Неопределено
			, "Заявки");	
	Диаграмма.УстановитьЗначение(Точка
			, Диаграмма.Серии[2]
			, КолПродаж
			, Неопределено
			, "Продажи");
	
	Диаграмма.ОбластьЗаголовка.Текст 	= "Воронка продаж";
	Диаграмма.АвтоТранспонирование 		= Истина;
	Диаграмма.Обновление				= Истина;
	
КонецПроцедуры
